docs/torsten_users_guide.org
#+TITLE: Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan
#+SUBTITLE: User's Guide @@latex:\\@@ @@html:<br>@@ (Torsten Version 0.90.0, Stan version 2.29.2)
#+LATEX_CLASS: amsbook
#+LATEX_CLASS_OPTIONS: [12pt, reqno, oneside]

# title page
#+LATEX_HEADER: \newcommand\subtitle[1]{\newcommand\mrgsubtitle{#1}}
#+LATEX_HEADER: \newcommand\mrgproject{}
#+LATEX_HEADER: \newcommand\mrgtitle{Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan}
#+LATEX_HEADER: \newcommand\mrgsubtitle{\large{User's Guide} \linebreak (Torsten Version 0.90.0, Stan version 2.29.2)}
#+LATEX_HEADER: \include{mrgtitlepage}

# make index
#+LATEX_HEADER: \usepackage{imakeidx}
#+LATEX_HEADER: \makeindex

#+LATEX_HEADER: \usepackage[letterpaper, width=6.5in, height=9in]{geometry}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{pdfpages}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{epstopdf}

# define MRG branding color
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \definecolor{MRGGreen}{rgb}{0, 0.350, 0.200}
#+LATEX_HEADER: \usepackage[colorlinks=true, citecolor=MRGGreen, urlcolor=MRGGreen, linkcolor=MRGGreen]{hyperref}

#+LATEX_HEADER: \usepackage{bold-extra}
#+LATEX_HEADER: \usepackage{courier}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{siunitx}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[framemethod=TikZ, skipabove=10pt, skipbelow=10pt, backgroundcolor=black!3, roundcorner=4pt, linewidth=1pt]{mdframed}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{mdframed}}
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{mdframed}}

#+LATEX_HEADER: \usepackage{subcaption}

# remove "chapter" in chapter name
#+LATEX_HEADER: \renewcommand{\chaptername}{}
#+LATEX_HEADER: \numberwithin{equation}{chapter}
#+LATEX_HEADER: \numberwithin{figure}{chapter}
#+LATEX_HEADER: \numberwithin{table}{chapter}

#+LATEX_HEADER: \usepackage[section]{placeins}

# section numbering begins with chapter
** General ODE Model Function
   :PROPERTIES:
   :EXPORT_FILE_NAME: genode
   :EXPORT_DATE: <2021-06-25 Fri>
   :EXPORT_OPTIONS: toc:t
   :END:
*** Description
    Function =pmx_solve_adams=, =pmx_solve_bdf=, and =pmx_solve_rk45= solve a first-order ODE system
    specified by user-specified right-hand-side function =ODE_rhs= $f$
    \begin{equation*}
    y'(t) = f(t, y(t))
    \end{equation*}
    In the case where the =rate= vector $r$ is non-zero, this equation becomes:
    \begin{equation*}
    y'(t) = f(t, y(t)) + r
    \end{equation*}
*** Usage
#+INDEX: General ODE Model
#+BEGIN_SRC stan
  matrix pmx_solve_[adams || rk45 || bdf](ODE_rhs, int nCmt, time, amt, rate, ii, evid, cmt, addl, ss, theta, [ biovar, tlag, real[,] x_r, int [,] x_i, real rel_tol, real abs_tol, int max_step, real as_rel_tol, real as_abs_tol, int as_max_step ] );
#+END_SRC
Here src_stan[:exports code]{[adams || rk45 || bdf]} indicates the
function name can use any of the three suffixes. See below.

*** Arguments
- =ODE_rhs=
     ODE right-hand-side $f$. It should be defined in
     src_stan[:exports code]{functions} block and has the following format
#+BEGIN_SRC stan
  vector = f(real t, vector y, real[] param, real[] dat_r, int[] dat_i) {...}
#+END_SRC
     Here =t= is time, =y= the unknowns of ODE, =param= the parameters, =dat\_r= the real data, =dat\_i=
     the integer data. =param=,
     =dat\_r=, and =dat\_i= are from
     the entry of =theta=, =x_r=,
     and =x_i= corresponding to
     =t=, respectively.
     $f$ should not include dosing rates in its
     definition, as Torsten automatically update $f$
     when the corresponding event indicates infusion dosage.
- =nCmt= 
     The number of compartments, equivalently, the dimension of the ODE system.
- =x_r=
     2d arary real data to be passed to ODE RHS. If specified, its 1st
     dimension should have the same size as =time=.
- =x_i=
     2d arary integer data to be passed to ODE RHS. If specified, its 1st
     dimension should have the same size as =time=.
- =rel_tol= 
     The relative tolerance for numerical integration, default to 1.0E-6.
- =abs_tol=
     The absolute tolerance for numerical integration, default to 1.0E-6.
- =max_step=
     The maximum number of steps in numerical integration, default to $10^6$.
- =as_rel_tol=
     The relative tolerance for algebra solver for steady state solution, default to 1.0E-6.     
- =as_abs_tol=
     The absolute tolerance for algebra solver for steady state solution, default to 1.0E-6.
- =as_max_step=
     The maximum number of interations in algebra solver for steady state solution, default to $10^2$.
- See Tables in Section [[*Events specification]] for the rest of arguments.

*** Return value
    An =nCmt=-by-=nt= matrix, where =nt= is the size of =time=.
*** Note
    - See Section [[*ODE integrator function]] for different types of integrator and general guidance.
    - See Section [[*ODE integrator function]] for comments on accuracy and tolerance.
    - The default values of =atol=,
      =rtol=, and =max_step= are
      based on a limited amount of PKPD test problems and should not be considered as
      universally applicable. We strongly recommend user to set these values
      according to physical intuition and numerical tests. See also Section [[*ODE integrator function]].
    - With optional arguments indicated by square bracket, the following calls are allowed:
#+BEGIN_SRC stan
  pmx_solve_[adams || rk45 || bdf](..., theta);
  pmx_solve_[adams || rk45 || bdf](..., theta, rel_tol, abs_tol, max_step);
  pmx_solve_[adams || rk45 || bdf](..., theta, rel_tol, abs_tol, max_step, as_rel_tol, as_abs_tol, as_max_step);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, rel_tol, abs_tol, max_step);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, rel_tol, abs_tol, max_step, as_rel_tol, as_abs_tol, as_max_step);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, tlag);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, tlag, rel_tol, abs_tol, max_step);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, tlag, rel_tol, abs_tol, max_step, as_rel_tol, as_abs_tol, as_max_step);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, tlag, x_r);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, tlag, x_r, rel_tol, abs_tol, max_step);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, tlag, x_r, rel_tol, abs_tol, max_step, as_rel_tol, as_abs_tol, as_max_step);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, tlag, x_r, x_i);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, tlag, x_r, x_i, rel_tol, abs_tol, max_step);
  pmx_solve_[adams || rk45 || bdf](..., theta, biovar, tlag, x_r, x_i, rel_tol, abs_tol, max_step, as_rel_tol, as_abs_tol, as_max_step);
#+END_SRC

